lisp/my-gptel.org
#+TITLE: My GPTel
#+PROPERTY: header-args:elisp :results silent :tangle my-gptel.el
#+AUTO_TANGLE: t

* Require
#+begin_src elisp
  (require 'gptel)
#+end_src

* Mode
#+begin_src elisp
  (define-derived-mode my-gptel-mode org-mode "GPTel")

  (defun my-gptel-mode-setup ()
    (interactive)
    (org-mode)
    (gptel-mode))

  (add-hook 'my-gptel-mode-hook 'my-gptel-mode-setup)
#+end_src

* Action: Clear buffer
#+begin_src elisp
  (defun my-gptel-clear-buffer ()
    (interactive)
    (erase-buffer)
    (insert "*** "))
#+end_src

* Post-response
#+begin_src elisp
  (defun my-gptel-post-response (&rest args)
    (save-excursion
      (goto-char (point-min))
      (while (not (eobp))
        (org-forward-paragraph)
        (let ((elem (org-element-at-point)))
          (when (member (org-element-type elem) '(paragraph item))
            (save-excursion
              (goto-char (org-element-property :begin elem))
              (fill-paragraph)))
          (when (string= (org-element-type elem) 'plain-list)
            (save-excursion
              (org-backward-paragraph)
              (fill-paragraph)))))))

  (add-hook 'gptel-post-response-hook 'my-gptel-post-response)
#+end_src

* Provide
#+begin_src elisp
  (provide 'my-gptel)
#+end_src
